

RESULT_PATH = './result_save_path'
INIT_EXCEL_PATH = "현황교통량형식.xlsx"

EXCEL_SHEET_NAEMS = ['01. 복용네거리', 
                     '02. 박산삼거리', 
                     '03. 인삼골네거리', 
                     '04. 진터네거리', 
                     '04. 진터네거리 지하차도', 
                     '05. 상원삼거리', 
                     '06. 원골네거리', 
                     '07. 도안네거리', 
                     '07. 도안네거리 지하차도', 
    
                    ]

EXCEL_CELL_COORD = {
    "1U" : (5,3),
    1 : (5,11),
    2 : (5, 19),
    3 : (5, 27),

    "4U" : (44,3),
    4 : (44,11),
    5 : (44, 19),
    6 : (44, 27),

    "7U" : (83,3),
    7 : (83,11),
    8 : (83, 19),
    9 : (83, 27),

    "10U" : (122,3),
    10 : (122,11),
    11 : (122, 19),
    12 : (122, 27),
}

ANALYSIS_UNIT = 15
FRIDAY_TIMES = [420, 720, 1020] # 7시~9시, 12시~14시, 17시~19시
SUNDAY_TIMES = [720, 840, 960] # 12시~18시